lab8/requests/people/createPerson.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="pl/pwr/java/lab8/soap/people">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:createPersonRequest>
            <person>
                <id>-1</id>
                <firstName>Sherlock</firstName>
                <lastName>Holmes</lastName>
            </person>
        </gs:createPersonRequest>
    </soapenv:Body>
</soapenv:Envelope>